blog/new-post.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-22 周五 22:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Hi</title>
<meta  name="generator" content="Org-mode" />
<meta  name="description" content="Hello"
 />
<meta  name="keywords" content="Hi" />


</head>
<body>
<div id="content">
<h1 class="title">Hi</h1>
<blockquote>
<p>
光阴似箭，日月如梭。
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa500;">&lt;errno.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa500;">&lt;stdarg.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa500;">"ourhdr.h"</span>

<span style="color: #ffff00;">char</span> *<span style="color: #ffa07a;">pname</span> = <span style="color: #fa8072;">NULL</span>; <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#35843;&#29992;&#32773;&#36890;&#36807;argv[0]&#26469;&#35774;&#32622;&#36825;&#20010;&#19996;&#35199;</span>
<span style="color: #00ffff;">static</span> <span style="color: #ffff00;">void</span> <span style="color: #00fa9a;">err_doit</span>(<span style="color: #ffff00;">int</span>, <span style="color: #00ffff;">const</span> <span style="color: #ffff00;">char</span> *, <span style="color: #ffff00;">va_list</span>);

<span style="color: #ffd700;">/*</span><span style="color: #ffd700;">&#21644;&#31995;&#32479;&#30456;&#20851;&#30340;&#38750;&#33268;&#21629;&#38169;&#35823;,&#36755;&#20986;&#20449;&#24687;,&#36820;&#22238;*/</span>
<span style="color: #ffff00;">void</span> <span style="color: #00fa9a;">err_ret</span>(<span style="color: #00ffff;">const</span> <span style="color: #ffff00;">char</span> *<span style="color: #ffa07a;">fmt</span>, ...)
{
    <span style="color: #ffff00;">va_list</span> <span style="color: #ffa07a;">ap</span>;
    va_start(ap, fmt);
    err_doit(1, fmt, ap);
    va_end(ap);
    <span style="color: #00ffff;">return</span>;
}

<span style="color: #00ffff;">static</span> <span style="color: #ffff00;">void</span> <span style="color: #00fa9a;">err_doit</span>(<span style="color: #ffff00;">int</span> <span style="color: #ffa07a;">errnoflag</span>, <span style="color: #00ffff;">const</span> <span style="color: #ffff00;">char</span> *<span style="color: #ffa07a;">fmt</span>, <span style="color: #ffff00;">va_list</span> <span style="color: #ffa07a;">ap</span>)
{
    <span style="color: #ffff00;">int</span> <span style="color: #ffa07a;">errno_save</span>;
    <span style="color: #ffff00;">char</span> <span style="color: #ffa07a;">buf</span>[MAXLINE];
    errno_save = errno; <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#23558;&#38169;&#35823;&#30721;&#23384;&#20648;&#36215;&#26469;</span>
    vsprintf(buf, fmt, ap);<span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#23558;&#27969;&#20889;&#20837;&#21040;buf&#37324;&#38754;</span>

    <span style="color: #00ffff;">if</span> (errnoflag)
        sprintf(buf + strlen(buf), <span style="color: #ffa500;">": %s"</span>, strerror(errno_save));
    strcat(buf, <span style="color: #ffa500;">"\n"</span>); <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#22312;buf&#21518;&#38754;&#21152;&#19968;&#20010;\n</span>
    fflush(stdout); <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#21047;&#26032;/&#26356;&#26032;&#26631;&#20934;&#36755;&#20986;</span>
    fputs(buf, stderr);<span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#23558;buf&#20013;&#30340;&#25968;&#25454;&#20889;&#20837;&#21040;&#26631;&#20934;&#20986;&#38169;&#20013;&#21435;</span>
    fflush(<span style="color: #fa8072;">NULL</span>); <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#21047;&#26032;&#25152;&#26377;&#30340;stdio&#36755;&#20986;&#27969;</span>
    <span style="color: #00ffff;">return</span>;
}

<span style="color: #ffd700;">/*</span><span style="color: #ffd700;">&#21644;&#31995;&#32479;&#35843;&#29992;&#26080;&#20851;&#30340;&#33268;&#21629;&#38169;&#35823;,&#36755;&#20986;&#20449;&#24687;,&#24182;&#32456;&#27490;*/</span>
<span style="color: #ffff00;">void</span> <span style="color: #00fa9a;">err_quit</span>(<span style="color: #00ffff;">const</span> <span style="color: #ffff00;">char</span> *<span style="color: #ffa07a;">fmt</span>, ...)
{
    <span style="color: #ffff00;">va_list</span> <span style="color: #ffa07a;">ap</span>;
    va_start(ap, fmt);
    err_doit(0, fmt, ap);
    va_end(ap);
    exit(1); <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#36864;&#20986;&#25972;&#20010;&#31243;&#24207;</span>
}

<span style="color: #ffd700;">/*</span><span style="color: #ffd700;">&#20851;&#20110;&#31995;&#32479;&#35843;&#29992;&#30340;&#33268;&#21629;&#38169;&#35823;,&#36755;&#20986;&#20449;&#24687;,&#24182;&#19988;&#36864;&#20986;*/</span>
<span style="color: #ffff00;">void</span> <span style="color: #00fa9a;">err_sys</span>(<span style="color: #00ffff;">const</span> <span style="color: #ffff00;">char</span> *<span style="color: #ffa07a;">fmt</span>, ...)
{
    <span style="color: #ffff00;">va_list</span> <span style="color: #ffa07a;">ap</span>;
    va_start(ap, fmt);
    err_doit(1, fmt, ap);
    va_end(ap);
    exit(1);

}

<span style="color: #ffd700;">/*</span><span style="color: #ffd700;">&#20851;&#20110;&#31995;&#32479;&#35843;&#29992;&#30340;&#33268;&#21629;&#38169;&#35823;,&#36755;&#20986;&#20449;&#24687;,&#20542;&#20498;core&#25991;&#20214;,&#36864;&#20986;*/</span>
<span style="color: #ffff00;">void</span> <span style="color: #00fa9a;">err_dump</span>(<span style="color: #00ffff;">const</span> <span style="color: #ffff00;">char</span> *<span style="color: #ffa07a;">fmt</span>, ...)
{
    <span style="color: #ffff00;">va_list</span> <span style="color: #ffa07a;">ap</span>;
    err_doit(1, fmt, ap);
    va_end(ap);
    abort(); <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#24322;&#24120;&#32456;&#27490;,&#20542;&#20498;core&#25991;&#20214;</span>
    exit(1); <span style="color: #ffd700;">//</span><span style="color: #ffd700;">&#31243;&#24207;&#24212;&#35813;&#36816;&#34892;&#19981;&#21040;&#36825;&#37324;</span>

}

<span style="color: #ffd700;">/*</span><span style="color: #ffd700;">&#20851;&#20110;&#31995;&#32479;&#35843;&#29992;&#30340;&#38750;&#33268;&#21629;&#30340;&#38169;&#35823;,&#36755;&#20986;&#20449;&#24687;,&#36820;&#22238;*/</span>
<span style="color: #ffff00;">void</span> <span style="color: #00fa9a;">err_msg</span>(<span style="color: #00ffff;">const</span> <span style="color: #ffff00;">char</span> *<span style="color: #ffa07a;">fmt</span>, ...)
{
    <span style="color: #ffff00;">va_list</span> <span style="color: #ffa07a;">ap</span>;
    va_start(ap, fmt);
    err_doit(0, fmt, ap);
    va_end(ap);
    exit(1);
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-01-30 周六</p>
<p class="date">Created: 2016-04-22 周五 22:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
